{
  "success": true,
  "data": [
    {
      "id": 0,
      "title": "Twisted Fork Bistro",
      "content": "<p>I love brunch. It’s perfect for people like me who sleep in on the weekends and don’t wake up early enough to eat breakfast. Vancouver also happens to be a place where there are a lot of great brunch spots to choose from. What better way to spend a late Saturday morning than with some girlfriends and catch up over brunch? Since Twisted Fork Bistro is a popular place for brunch, Mari, Owl, Robot Penguin, and I decided to give it a try.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08649.jpg?w=768&h=1024' /><p>The restaurant itself is small so they do not accept reservations. We arrived at around 11:15am and were told that it was going to be around a 30 minute wait. In actuality, it was more like a 45 minute wait.  For those who don’t like waiting in line, I recommend going right when they open their doors at 10 am on the weekends.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08672.jpg?w=1024&h=768' /><p>The bistro has a funky and relaxed vibe to it. The black and white photographs that line the wall adds an artistic and sentimental appeal. The various decorations and artwork also contribute to the charm of the restaurant.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08663.jpg?w=1024&h=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc086571.jpg?w=768&h=1024' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08662.jpg?w=1024&h=768' /><p>When we were seated, the friendly server handed us a menu of the brunch items to browse over. I love the twisted fork on the menu!</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08659.jpg?w=1024&h=768' /><p>I went with the <b>Eggs Benny</b> since I have never tried it before.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08676.jpg?w=1024&h=768' /><p>For the filling, I chose smoked salmon. It was served with sides of sautéed spinach, rosti (which is kind of like hash browns), and baked beans.This dish is a twist to the traditional eggs benedict, as the poached eggs were served on top of toasted brioche instead of the regular English muffin. It was my first time trying brioche, and I can’t say I’m too fond of it. The texture is too dry and crumbly for me. However, It did do a good job of soaking up the runny egg yolk from the perfectly poached eggs! The generous amount of smoked salmon piled on top of the toasted brioche tasted delicious. I could’ve had a whole plate of that on its own.</p><p>Robot Penguin also ordered the eggs benny, but chose bacon as the filler.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08673.jpg?w=1024&h=768' /><p>Mari ordered the <b>Gruyere Baked Eggs</b> which came with sourdough toast, bacon, rosti, tomato, and baked beans.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08674.jpg?w=1024&h=768' /><p>She let me try some her sourdough toast and jam. The jam is made in-house, and I have to say it was very good! It tastes natural and less sweet and artificial than supermarket jams. They sell jars of their housemade jam for people who enjoyed its taste and want to bring some home with them. I also tried a bite of the baked eggs, which was I thought was tasty and savoury but a little too heavy.</p><p>Owl went with the <b>Bacon, Caramelized Onion and Brie Frittata</b> filled with plum tomatoes and fresh basil and served with fresh greens and sweet corn relish.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08675.jpg?w=1024&h=768' /><p>The bite of the frittata I had was delicious, though I do agree with Owl that the sweet corn relish is a little too sour.</p><p>Jars of different flavoured jams for sale:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/05/dsc08666.jpg?w=768&h=1024' /><p>Overall, I think that Twisted Fork Bistro is a solid brunch spot. The food portions are quite large, and we all had trouble polishing off our plates. I like how the brunch items come with different sides than the usual home fries or hash browns. The service was friendly, and I enjoyed the ambient music and cozy setting that served to create a relaxing atmosphere. Twisted Fork Bistro is also open for dinner, and I might return to try some of the French bistro items on their menu such as mussels with frites and oxtail soup!</p><a href='https://www.zomato.com/vancouver/twisted-fork-bistro-downtown'>Twisted Fork Bistro on Zomato</a>"
    },
    {
      "id": 1,
      "title": "Frankie’s Italian Kitchen",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08041.jpg?w=768&h=576' /><p>Located in the Georgian Court Hotel, Frankie’s Italian Kitchen is sophisticated and elegant without being pretentious. PonDeRing introduced me to this hidden gem in downtown Vancouver after she was there for a date with Mochi. Both of them had only positive things to say about their dining experience that night. Read her review <a href='https://simpleaffairs.wordpress.com/2011/10/10/frankies-italian-kitchen/'>here</a>.</p><p>Although I love Italian food, I actually don’t eat it very often. When I do, it’s never at restaurants that serve authentic or superior Italian food that hasn’t been modified under the influence of American culture.  This visit was an opportunity for me to indulge in some good quality Italian cuisine and for PonDeRing and Mochi to satiate their cravings for more delicious and flavourful pasta dishes. My other good friend, JL, also accompanied us for dinner.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08043.jpg?w=768&h=576' /><p><i>Entrance</i></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08074.jpg?w=768&h=576' /><p><i>Decor - Elegant and Classy</i></p><p>Our server of the night was a very friendly and hospitable Italian lady who never failed to make us feel welcome here. She started us off with water and bread while we took our time to peruse the menu.</p><p><b>Bread with Extra Virgin Olive Oil + Balsalmic Vinegar</b>  (complimentary):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08048.jpg?w=768&h=576' /><p>The bread tasted fresh and was delicious dipped in the olive oil + balsalmic vinegar dressing. The texture of the bread was chewy and soft — it was so good that we finished what was served to us in no time and asked for seconds.</p><p><b>Beef Carpaccio</b> (classic Italian starter prepared with premium beef filet, extra virgin olive oil, capers and our chef’s inspiration) $15:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08052.jpg?w=768&h=576' /><p>We ordered this as an appetizer after PonDeRing and Mochi ordered it the last time they were here and raved about how good it was. This was truly delicious and a must order. The beef slices were thin and delicate, and the bed of fresh arugula and shaved parmesan cheese were the perfect complements.</p><p><b>Seafood Linguine</b> (poached half lobster in ragout of clams, salmon, halibut, mussels, scallops and prawns) $21:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08068.jpg?w=768&h=576' /><p>We ended up ordering four different pastas and shared some with one another so everyone could have a taste of each one. This pasta was the most expensive one on the menu, but well worth the money. It was abundant with seafood such as clams, mussels, and salmon. The highlight of this dish was the poached half lobster, which tasted succulent and tender.</p><p><b>Spaghetti & Meatballs</b> (tossed in tomato sauce and topped with aged ricotta cheese) $14:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08066.jpg?w=768&h=576' /><p>The tomato based sauce was well seasoned with herbs and did not taste overly sour or acidic.  As for the spaghetti noodle, it was cooked until perfectly al dente.  The slice of aged ricotta cheese did not taste like much, but it did add richness and an Italian twist to this Italian American classic.</p><p><b>Salmon Maltagliati</b> (fresh sockeye salmon with broccoli, cream and pecorino cheese) $15:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08063.jpg?w=768&h=576' /><p>This dish was ordered from their “Fresh House Made Pasta” menu. I would recommend this menu to those who would like to venture out from traditional pasta dishes and try something different. The pastas from this menu are made in house with a pasta machine and not made from dried pastas. They feature newly inspired Italian dishes, which means that they differ from the more traditional Italian pastas in terms of flavour and ingredients. Maltagliati means “badly cut”, which would reflect the irregularity in shape of the pasta in this dish. The Maltagliati pasta was thin and flat while being chewy in texture.  I can’t really comment on this dish because I’m not a fan of cream sauce pastas, but I did enjoy the bite that was offered to me.</p><p>Chicken Linguine (chicken in sun-dried tomato pesto cream sauce) $14:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08065.jpg?w=768&h=576' /><p>The pesto cream sauce was full of flavour and enlivened by the aroma of crushed basil leaves. The chicken pieces were tender and not too dry. If a dish is able to satisfy the most picky of eaters, you can probably conclude that it must taste delicious. The chicken linguine was able to do that, as Mochi raved about how good it was and preferred it over the spaghetti and meatballs dish that he ordered last time. PonDeRing also really enjoyed this and said she would definitely order it the next time she’s here.</p><p><b>Ice Cream Cassava</b> (Chocolate ice cream with diced almonds, raisins, and sun dried cranberries encased in a thin layer of sponge cake, served with chocolate fondue) $7:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08081.jpg?w=768&h=576' /><p>Although we were all full from our pastas, I really wanted to order the Ice Cream Cassava. It turned out to be a good choice, as it was as decadent and delicious as it looks in the picture. It was topped off with diced pistachios rather than the diced almonds in the description of the dessert menu, which was a nice surprise.</p><p><b>Inniskillin Cabernet Sauvignon (9 0z)</b> $12:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc08078.jpg?w=768&h=1024' /><p>This picture was taken after the majority of wine was consumed by Mochi and JL. Apparently there was some confusion when the wine was being ordered — Mochi asked our server to recommend wines that were less dry, but I think she misheard it as extra dry and recommended this one. I took a sip and thought it tasted fine, albeit a little too strong and bitter for my liking. But then again, I’m no wine connoisseur.</p><p>The service we received that night was exceptional, and our server constantly came by to refill our water glasses and made sure everything was going well. I would say that the pastas dishes here are definitely quality over quantity. The portion sizes of the pastas look really small in pictures, but they actually gave us just enough so there was no food left over. I can’t say for the other food items on the menu such as the pizzas and steaks, but the pastas are definitely a plus in my books. The ambiance was intimate and cozy, and everyone had a wonderful time. I would recommend this restaurant to those looking for somewhere to dine at with hospitable service,  elegant setting, and delicious food.</p><a href='https://www.zomato.com/vancouver/frankies-italian-kitchen-bar-yaletown-vancouver'><b>Frankie's Italian Kitchen & Bar on Zomato</b></a>"
    },
    {
      "id": 2,
      "title": "What8ver Cafe",
      "content": "<p>It’s been nearly a year since my last post! Don’t worry, I was only temporarily on leave and did not intend to neglect my blog forever. Although I have been meaning to sneak in a few entries in between my busy schedule, it never did manage to work out. Now that reading break has commenced, I’m planning to get my blog active again and aiming to update it at least two times a week.</p><p>My visit to What8ver Cafe was pretty spontaneous actually. PonDeRing and I were planning to go there after shopping at Daiso to try the honey toast box, but changed our minds when two of our friends who were supposed to go with us didn’t come in the end. While shopping at the newly opened H-Mart at Aberdeen Centre, we ran into some friends who were going to What8ver Cafe for dinner and decided to join them. <i>Thanks for inviting us, J!</i></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07978.jpg?w=1024&h=768' /><p>What8ver Cafe is a bubble tea place in Richmond that serves Taiwanese snacks, light meals, and drinks. It’s pretty small inside and only has around six tables, so I would recommend making a reservation to avoid long waits during peak hours.  They do not have any full sized meals on the menu, but you can upgrade to a meal by adding $2 to any single Taiwanese snack item.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07979.jpg?w=1024&h=768' /><p>What I was particularly interested in at What8ver Cafe was the honey toast box. I first heard of honey toast boxes when I read about a place called Dazzling Cafe in Taiwan that serves it there. A honey toast box is a half a loaf of bread that is hollowed, and the inside of the bread is cut into strips which is then coated with honey and toasted. It is then decorated with ice-cream and fruits to create a fancy looking dessert.  Despite being the specialty of What8ver Cafe, the honey toast box is <b>not</b> on the menu – you just have to know about it and ask for it. Since the honey toast box generally takes a longer time to prepare, we started off by ordering two to share between seven people. They have three flavours available: matcha + red bean, strawberry, and vanilla. We chose the matcha + red bean and the strawberry honey toast boxes.</p><p><i>*Excuse the bad pictures – we were seated in a dim part of the restaurant and our main source light came from the flame of two small tea candles.</i></p><p><b>Strawberry Honey Toast Box </b>($8):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07981.jpg?w=1024&h=768' /><p>I didn’t get a chance to take a picture of the toast box before it was cut apart by the waitress. This toast box came with slices of strawberries, custard cream, a scoop of strawberry ice-cream, and strawberry sauce on top.</p><p><b>Matcha +Red Bean Honey Toast Box </b>($8):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07980.jpg?w=1200&h=1600' /><p>How it looked like deconstructed:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07982.jpg?w=1200&h=1600' /><p>This honey toast box came with red beans, custard cream, and a scoop of matcha ice-cream on top. Comparing this to the strawberry honey toast box, I liked this one much better. The bitterness of the matcha ice-cream complemented well with the sweetness of the honey coated bread sticks and red beans.</p><p>Although the honey toast boxes were good, I have to admit that I wasn’t entirely blown away. In terms of taste, I thought the bread sticks were a little too sweet and preferred eating the “box” of the toast which was not as crunchy and coated with less honey. This may be due to the fact that I’m not a big fan of honey, and people who do enjoy the taste of honey will have different opinions than I do.  I also expected the honey toast box to be fancier in its presentation, but that was not the case here. I feel that four people per honey toast box is perfect – although the seven of us finished all of the strawberry honey toast box, we couldn’t finish the matcha + red bean one. Since bread is filling, we were essentially half full from the honey toast boxes before the other food arrived.</p><p><b>Green Milk Tea with Pearls </b>$3.50:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07989.jpg?w=1200&h=1600' /><p>It was a good thing PonDeRing and I shared this, since it was too much for one person to finish. The glass that the drink was served in is pretty unique – PonDeRing commented that the glass resembled a mayonnaise jar. The green milk tea was good and did not taste overly sweet. Since the glass was so big, we ended up only finishing around half of it.</p><p><b>Aloe + Lemon Tea:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07984.jpg?w=1024&h=768' /><p>Took a picture of Robot Penguin’s drink because it looked so pretty. I thought it tasted very light and refreshing. RP said that it is a good drink to have during the summer.</p><p><b>Taiwanese Deep Fried Chicken (鹹酥雞) $5.50:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07985.jpg?w=1024&h=768' /><p>This dish is a popular snack item in the nightmarkets of Taiwan and was done well here.  The chicken pieces fried until crispy and were tender on the inside. The basil leaves added a hint of fragrance to the chicken pieces that this dish would not be the same without.</p><p><b>Taiwanese Deep Fried Squid Tentacles (炸魷魚）</b>$5:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07987.jpg?w=1024&h=768' /><p>The squid tentacles were prepared the same way as the chicken nuggets. Again, the basil leaves were a nice touch and added a fragrant flavour to the deep fried squid tentacles.</p><p><b>Taiwanese Deep Fried Pork Chop </b>(炸排骨）:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07992.jpg?w=1024&h=768' /><p>The pork chop tasted authentically Taiwanese – like how my grandma makes it.  The sauce on the side wasn’t really needed in my opinion. I can’t recall how it tasted since I only tried a bit – maybe it was tonkatsu sauce.</p><p><b>Braised pork belly over rice</b> (魯肉飯):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2012/02/dsc07986.jpg?w=1024&h=768' /><p>This is the bowl of rice that you get when you upgrade to a meal. A pretty good deal, since it’s much better than plain white rice. The braised pork belly was flavourful and went well with the rice.</p><p>All in all, What8ver Cafe is a great place to hang out with friends for a taste of authentic Taiwanese snacks and bubble tea drinks. It’s also one of the few places in the lower mainland that serves honey toast boxes. I’m planning to try the honey toast box at Dazzling Cafe in Taipei when I’m there in the summer.  I would probably come back to try some other snack items the next time I’m in the vicinity and missing Taiwanese food.</p><a href='https://www.zomato.com/vancouver/what8ver-cafe-central-richmond-richmond'>What8ver Cafe on Zomato</a>"
    },
    {
      "id": 3,
      "title": "Sushi Garden",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-028.jpg?w=768' /><p>Sushi Garden is my favourite go-to place for cheap, delectable, and good value for the money sushi. Conveniently located across Metrotown in Burnaby, it is always busy and packed with people looking to fill up on decent Japanese food while staying within budget. Although the food is not authentic Japanese food by any means, the big portions and reasonable prices are what keeps Sushi Garden so popular among locals.</p><p>It could be the fact that I usually frequent there during meal times, but I have always had to put my name down at the front desk and wait for a table every time I’m there. The average wait time is around 15-20 minutes, but it also depends on when you go.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-010.jpg?w=768' /><p>The interior of the restaurant looks so much better after a much needed renovation. It looks much more modern and clean, although the seating area is still a bit cramped. It’s not hard to listen in to the conversations of the tables next to you without really trying to.</p><p>On this particular visit, I was joined by PonDeRing and Mochi for a casual lunch. Although it was a weekday, we still had to wait for around ten minutes before a table opened up for us. After being served tea and presented with the menu, we proceeded to order. The service was prompt, and we did not have to wait long until the items we ordered were presented to our table.</p><p><b>Salmon Sashimi </b>($7.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-018.jpg?w=768' /><p>The slices of salmon sashimi were thick and tasted really fresh. I always order the sashimi here because I’m never disappointed with the quality! The sashimi is never frozen, and is a steal at only $7.95 for eight slices.</p><p><b>Assorted Tempura </b>($7.50):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-022.jpg?w=768' /><p>The assorted tempura came with pieces of prawn, zucchini, and sweet potato.  The batter was not too thick and was coated evenly. Pretty good.</p><p>We ordered three rolls: <b>Crab ♥s Papaya Roll, Dynamite Roll, </b>and<b> Alaska Roll</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-024.jpg?w=768' /><p><b>Crab ♥s Papaya Roll </b>($3.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-027.jpg?w=768' /><p>The unique name of this roll prompted me to order it from the menu. The papaya was hard and slightly chewy, not mushy and soft like the kind I’m used to eating. Maybe it wasn’t ripe enough? Or could be a different variety. Either way, the taste of papaya was subtle and was not too overpowering. The deep fried crab was tasty and paired well with the light tasting papaya. The julienned cucumber tasted refreshing and light.</p><p><b>Dynamite Roll </b>($3.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-026.jpg?w=768' /><p>There was just the right proportion of rice to ingredients in this roll. The prawn tempura was crispy, while the masago sprinkled on top provided a hint of flavour and texture. Overall, I would say this roll was tasty, but not that special.</p><p><b>Alaska Roll </b>($3.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-025.jpg?w=768' /><p>This is my absolute favourite roll at Sushi Garden! I think it’s also their most popular roll. It is basically an avocado roll topped with a slice of salmon sashimi and covered with a special sauce. The avocado in the Alaska roll is really creamy, and the tangy sauce  drizzled on top kicks the flavour up a notch. The sauce is what really makes this roll special — no need for soy sauce! What I also like about this roll is the fact that the pieces are bite sized. I hate it when the rolls are too big and the contents end up spilling out when you bite it in half. Sort of defeats the purpose of making the roll so large when you have to eat the ingredients separately anyway, in my opinion.</p><p>The grand total:</p><p>Not too bad for three people, agreed? We left satiated, and no food was left over. The service that we received on this visit was okay, although it does decline as the restaurant gets busier (on weekends especially).</p><p>My only complaint about this place is that the ambiance is rushed and noisy, and the servers can be inattentive when it gets busy.  Don’t come on a date night,  as you will surely be disappointed. With that being said, Sushi Garden is great place for a casual lunch or dinner with family and friends.</p><a href='https://www.zomato.com/vancouver/restaurants/sushi-garden'>Sushi Garden (Kingsway) on Zomato</a>"
    },
    {
      "id": 4,
      "title": "Richmond’s Summer Night Market 2011",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-065.jpg?w=768' /><p>Going to the Summer Night Market in Richmond has been a tradition of mine every summer since I found out about it years ago.  It’s extremely popular and always packed with people, especially if you go later in the night. Go early to avoid the crowd! For those who have never been there before, the night market consists of food stalls as well as stalls selling merchandise at cheaper prices.</p><p>I usually don’t buy anything from the merchandise stalls, as the items sold are usually cheap, albeit lower in quality. I’m much more interested in the food — as are most people,  judging from the massive crowds and long line-ups for some of the more popular food stalls.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-067.jpg?w=768' /><p>On this occasion, I was accompanied by Ames, RiceCake, and JL. We ordered a lot of food… so here goes!</p><p><b>Grilled Squid Legs:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-058.jpg?w=768' /><p>It was fun watching them grill the squid legs. There was a lot of smoke though, so be careful not to stand too close.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-064.jpg?w=768' /><p>I only had a bit of this, but from what I recall it was pretty good and flavourful. The squid legs were chewy and grilled to perfection.</p><p><b>Meat Skewers:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-069.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-081.jpg?w=768' /><p>Sorry for the blurry picture, it was hard to get a good shot. I think those are lamb and beef skewers?  These were 3 for $6. I didn’t have any, but those who did seemed to have enjoyed it.</p><p>A Taiwanese food stall that sells lots of interesting food:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-086.jpg?w=768' /><p>This stall offers Taiwanese hotdog, which is a traditional Taiwanese snack known as “small sausage in large sausage” in Taiwan. The bun part is sticky rice instead of bread, and the hotdog portion is Taiwanese pork sausage. Instead of ketchup and mustard, it’s topped with garlic and pickles among other condiments.</p><p>They also have candied fruit skewers here as well, which are strawberries coated in hardened sugar.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-084.jpg?w=768' /><p>When I saw the picture of the “marshmallow sandwich”, i was pretty surprised… i have never heard of such a thing before. According to my sister who heard from my mom, they are a new item sold in Taiwan night markets and are quite popular. After doing some research, I found out they are deep fried mantou (bun) stuffed with colourful marshmallows and drizzled with condensed milk.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-085.jpg?w=768' /><p><b>Salt & Pepper Chicken Nuggets:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-087.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-089.jpg?w=768' /><p>This was $4 for a pretty small bag. The chicken pieces were crispy on the outside and tender on the inside.  I think the dried basil really takes the chicken nuggets to another level — it’s incomplete without it!</p><p><b>Takoyaki:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-075.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-071.jpg?w=768' /><p>One thing that I got to have every time I visit the night market is takoyaki! I don’t eat them anywhere else in Vancouver, because I like them made fresh! There were at least three stalls selling this that were all close to one another, so I really didn’t know which one to go to… eventually, we went to the one with the shortest line-up. Aside from the traditional takoyaki filled with octopus, they also offer shrimp, scallop, and veggie options. We stuck with the traditional octopus takoyaki:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-073.jpg?w=768' /><p>The service was really fast — probably because the takoyaki was pre-made, and all the person had to do was put the condiments on top… I didn’t realize they already pre-made a bunch and put them on the side. The takoyaki was still piping hot inside though, so it wasn’t too bad. I thought they tasted tasted pretty good — on par with the takoyaki that I had before. I only detected one small piece of octopus inside the ball of takoyaki though… wish they had put more in. Aside from that, they were delicious! The combination of mayo, teriyaki sauce, and bonito flakes just taste so good together on top of the octopus balls.</p><p><b>Grilled Corn:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-092.jpg?w=768' /><p>The line-up for the grilled corn was super long! I don’t remember how much this was… maybe $2 per corn on the cob. After they grill it, you can sprinkle spices on top for some extra flavour. I think I got cayenne powder… turned out to be super spicy, and I had to rub the majority off with a napkin.</p><p><b>Turkey Leg:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-094.jpg?w=768' /><p>This turkey leg was really big. We all shared this, since it’s too big for one person to eat alone and still have room to eat other things. The turkey meat was not too dry, and was cooked nicely.</p><p><b>Bubble Waffle:</b></p><p>I was seriously craving for bubble waffles ever since we arrived at the night market… but i wanted to wait until we ate the “salty” things before moving on to the sweet.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-1001.jpg?w=768' /><p>I think the bubble waffles were  one for $4, and two for $7. Aside from the original flavour, they also have strawberry and chocolate. When I went to order, we wanted to get one original and one strawberry. The lady told me they ran out of strawberry for the day, so we got two original flavours in the end.</p><p>The bubble waffles, it tasted good — crispy on the outside and slightly chewy. It certainly satisfied my craving!</p><p>Lastly, we went for some mango desserts at this stall that looked pretty good:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-099.jpg?w=768' /><p><b>Fresh Mango Tapioca:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-103.jpg?w=768' /><p>This was a cool and refreshing dessert. The mango was really fresh (not the canned stuff), and the tapioca and coconut milk tasted great together as well.</p><p><b>Mango Shaved Ice:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-27-2011-sushi-nightmarket-105.jpg?w=768' /><p>This came in quite a large bowl, good for two people to share together. Although it was very tasty, we had trouble finishing it because it was so cold. This would be a more enjoyable dessert on a hotter day.</p><p>I had a great time walking around the stalls and trying different snack items. Can’t wait to return next summer!</p><a href='https://www.zomato.com/vancouver/richmond-night-market-richmond'>Summer Night Market 夏日夜市 on Zomato</a>"
    },
    {
      "id": 5,
      "title": "Aberdeen Food Court – Ajijiman Hanabi & Frappé Bliss",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/05/may-19-2011-richmond-day-033.jpg?w=768' /><p>After shopping at Daiso, PonDeRing and I wandered up to the food court at Aberdeen Centre for lunch. We originally wanted to go to Aoyama Cafe, but decided against it after thinking there would be much cheaper and tastier alternatives at the food court.  I like the food court at Aberdeen Centre because of its diverse selection of Asian cuisine and comfortable seating areas. Since I wasn’t feeling very adventurous that day, I settled for Japanese food at Ajijiman Hanabi with its eye-catching menu board. I do regret my decision somewhat, as there are a lot of other good food items in the Aberdeen food court worth trying. I’ve heard good things about the chicken wings at Wo Fung Dessert — definitely going back to try it out in the near future.</p><p><b>Grilled Chicken Don </b>(~$6):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-19-2011-richmond-day-034.jpg?w=768' /><p>The portion size was good, but I found this don to be lacking in flavour. The chicken pieces were decent, but nothing to write home about. The rice bowl looked good presentation-wise, but the mayo drizzled on top of the chicken did not enhance its taste in any way. The rice was very bland — after finishing the chicken, I was left with a pile of flavourless rice with nothing to accompany it with.</p><p><b>Kimchi beef don </b>(~$6):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-19-2011-richmond-day-035.jpg?w=768' /><p>PonDeRing went with the kimchi beef don. It turned out to be a great choice, as it tasted a lot better than the chicken katsu don I ordered. The kimchi added a lot of flavour to this dish, and the beef pieces were tender and plentiful.</p><p>Overall, don’t come here if you’re looking for great tasting, authentic Japanese food. However, they do offer a diverse selection of Japanese food items on their menu, as well as takoyaki and okonomiyaki.</p><a href='https://www.zomato.com/vancouver/ajijiman-central-richmond'>Ajijiman Hanabi (Aberdeen Centre) on Zomato</a><p><b>Frappé Bliss</b></p><p>After lunch, we decided to get some dessert. There are a lot of dessert places in the Aberdeen food court, including Beard Papa’s cream puffs, Qoola frozen yogurt, and Mazazu Crepe. There is one place that I have always wanted to try whenever I’m at Aberdeen — Frappe Bliss, which specializes in shaved ice desserts.</p><p>The shaved ice at Frappé Bliss is known as “xue hua bing” in Taiwan and translated as “snowflake ice”. Snowflake ice is like shaved ice, except it’s finer in texture and more feathery. Their shaved ice comes in a plethora of different flavours such as milk, peanut, mango, strawberry, etc. You can either choose flavour combinations that are already made for you from the board, or choose the flavour of the ice and toppings yourself.</p><p><b>Matcha Delight (~$5):</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-19-2011-richmond-day-041.jpg?w=768' /><p>We ordered the matcha delight, which came with sweet red beans, chewy rice balls, and a scoop of green tea ice-cream on top. We chose the milk flavoured  ice, which we thought would go best with the toppings. Turns out we were right, because the combination was amazing! The green tea ice-cream and red beans complemented each other well, and tasted amazing with the milk flavoured ice. I’m glad they were not stingy with the toppings. I loved the chewy rice balls… they don’t really taste like anything, but I enjoy them for their chewiness.</p><p>Here’s a close-up of the snow ice:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/06/may-19-2011-richmond-day-053.jpg?w=768' /><p>See how fine it looks? The ice was so creamy and smooth! Each bite just melts in your mouth. It was truly a blissful experience.</p><p>Snowflake ice is a popular dessert in Taiwan, especially in night markets. They have all sorts of flavours there and at incredible prices! I didn’t get to try it out the last time I went back for a visit, but I will make it a point to eat it the next time I’m there!</p><a href='https://www.zomato.com/vancouver/frappe-bliss-central-richmond-richmond'>Frappe Bliss (Aberdeen Centre) on Zomato</a>"
    },
    {
      "id": 6,
      "title": "Beard Papa’s",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/cream-puffs-and-bird-0041.jpg?w=768' /><p>Beard Papa’s is a cream puff chain store from Japan that has multiple locations in the Lower Mainland such as Burnaby, Richmond, and downtown Vancouver. If you haven’t tried them out yet, you should! The cream puff shells are crispy in texture, while the cream inside is light and airy.</p><p>What I really like about Beard Papa’s cream puffs is how fresh they are and taste. Branded as “fresh’n natural cream puffs”, they really do live up to their name. The custard filling is made fresh everyday with natural ingredients. I love how many different flavours they have as well, with my favourite so far being the original — vanilla.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/cream-puffs-and-bird-009.jpg?w=768' /><p>On this occasion, PonDeRing brought back home a half dozen cream puffs from the location in Richmond Centre. They had a new flavour, black sesame flavoured cream puffs available on that day. I’ve never tried it before, so I was quite excited to try it out.</p><p><b>Black Sesame </b>($1.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/cream-puffs-and-bird-008.jpg?w=768' /><p>I’m a big fan of black sesame, but this cream puff was quite disappointing. The flavour of black sesame was too strong and gave the custard filling a hint of bitterness. I think that maybe a tad more sugar is needed to balance out the natural bitterness of black sesame. The choux pastry shell, however, was crispy and delicious.</p><p><b>Green Tea ($1.95):</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/cream-puffs-and-bird-0151.jpg?w=768' /><p>I love green tea desserts, but this one wasn’t that good. The flavour of the green tea was present, but I think more green tea powder would have made this even better. From the picture, you can see that not a lot of green tea powder was used in the custard filling — hence the light green colour.</p><p><b>Eclair ($1.95):</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/cream-puffs-and-bird-029.jpg?w=768' /><p>I’ve never tried eclairs until now, but it’s become my new favourite from Beard Papa’s! It’s basically an original vanilla cream puff with dark chocolate on top. The vanilla cream puff is already delicious by itself, and the chocolate coating is the icing on the cake. With the eclairs, you get the best of both worlds — chocolate andvanilla. Do give this a try if you’re a chocolate lover like me.</p><p>As usual, the cream puffs were filled with a generous amount of custard cream, so they do make for quite a satisfying snack. I really wanted to try the strawberry or earl grey tea flavours, but they never seem to have them whenever I’m there. They also have other items on the menu such as  ice-cream puffs and fondant au chocolate, but I think their availability varies with location.</p><a href='https://www.zomato.com/vancouver/restaurants/beard-papas'>Beard Papa's (Richmond Centre) on Zomato</a>"
    },
    {
      "id": 7,
      "title": "Chicco",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-158.jpg?w=768' /><p>After dinner at Chungdam Ahn, we stopped by Chicco on Robson St for some dessert. Chicco is a Japanese dessert cafe specializing in Japanese style parfaits, but they also make delicious looking cakes as well. How do you pronounce “Chicco”? I always thought you say it like “chi-co”, but after reading the Japanese pronunciation, I think it’s supposed to be “ki-co” (キッコー）instead.</p><p>The cafe itself is tiny, and there is only enough room to seat about four tables of people. All of the tables were occupied when we went inside, but luckily one opened up just as we were placing our orders.</p><p>Here is a menu of their drinks and parfaits hanging on the wall:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-130.jpg?w=768' /><p>They have a lot of flavours available for the parfaits, but I was only interested in one that day – the matcha parfait that was advertised on the board outside the cafe. The cheesecake parfait that I saw someone order looked good as well.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-156.jpg?w=768' /><p>When I went up to order, the lady behind the counter told us that we had to have a minimum order of one item per person in order to sit in to eat at the restaurant. I guess it’s because the seating is so limited, but we were really only interested in the parfait and nothing else. Since the parfait is already so expensive ($7.50 each), it doesn’t seem very fair for that rule to exist. No one wanted to eat outside though, so we all had to abide to the rule and order something in order to sit down to eat inside.</p><p><b>Green Tea Parfait </b>($7.50):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-122.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-123.jpg?w=768' /><p>Keeping with the green tea theme, the parfait consists of (from top to bottom): a ball of green tea gelato, a block of green tea mousse cake, red bean, 2 pieces of mochi, whipped cream, green tea jelly, cornflakes, a ball of vanilla gelato, and chunks of sponge cake at the very bottom.</p><p>Everything tasted delicious, except it gets a bit dry when you get down to the layer of cornflakes if you don’t mix it with the whipped cream well. I would have preferred more of the vanilla gelato to replace some of the whipped cream, because I think it goes better with the cornflakes and sponge cake. By the time you get down to the sponge cake layer though, there is most likely no more cream or gelato to moisten the cake — something they should work on improving. The mochi pieces were nice and chewy, which left me craving for more.</p><p><b>Iced Coffee: </b>($3.50):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-132.jpg?w=768' /><p>Since PonDeRing and I shared a parfait and were too full from dinner to get one each, I got an iced coffee to satisfy the rule of minimum one order per person to sit in. This was just ordinary iced coffee, nothing too special about it. They left out the sugar and cream for you to add yourself, which is good since you can flavour it to your own liking.</p><p>I thought the decorations on the wall was interesting:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-129.jpg?w=768' /><p>The parfait didn’t disappoint in taste, but my only complaint is the price. Since there are not a lot of places in Vancouver that offer Japanese style parfaits yet (Aoyama Cafe in Aberdeen Centre and Mimibuloveme is the only other places I know), many people will still order it despite the price because of the novelty. I would probably go back more often to try the other flavours of parfait on their menu if they were less expensive.</p><a href='https://www.zomato.com/vancouver/chicco-west-end-vancouver'>Chicco on Zomato</a>"
    },
    {
      "id": 8,
      "title": "Chungdam Ahn",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-030.jpg?w=768' /><p>To celebrate the last day of classes before the start of final exams, I went to Chungdam Ahn  for dinner with PonDeRing, Mochi, and JL. It was a good opportunity to use up the 50% off coupons that I had bought online which were fast reaching their expiry date. Chungdam Ahn is a Korean izakaya on the corner of Robson St that is fairly hidden from the eyes of strolling passersby. I’ve only heard of Japanese izakayas in Vancouver, so the concept of a  Korean izakaya is new to me. I was curious to see how it would differ from the more traditional Japanese izakayas that I am more familiar to seeing. Being an izakaya style restaurant, Chungdam Ahn opens daily at 4:30pm and closes a couple of hours after midnight. The last time I came here, I didn’t check their hours so I ended up going somewhere else for lunch. Always check ahead of time!</p><p>They recommend making reservations ahead of time, so we reserved a table for 6:30pm. Since it was a Thursday and still early, there weren’t many people eating when we arrived. The windows of the restaurant resembles the windows of  Hapa Izakaya’s on Robson St, which looks dark to those who are standing outside looking in.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-085.jpg?w=768' /><p>The interior of the restaurant is dark, but the bright yellow lamps on the ceiling gives off a warm aura that fills the room. There are two types of menus, a regular one (which can be found on their website) and the “New Menu” which consists of a few items not listed in the regular menu. This is the latter:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-033.jpg?w=768' /><p>Besides Korean food, they also offer Japanese food such as sashimi, but we decided to stick with what they are probably better at.</p><p>After we placed our orders, we reminded our waitress that we were using the coupons, which included 2 complimentary rice wine cocktails:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-054.jpg?w=768' /><p>I didn’t care for the taste of the rice wine cocktail much, but my companions seem to have enjoyed it. It tasted a little bitter –  similar to the taste of sake, for those who have tried it before.</p><p><b>Grilled Squid</b> – <i>whole squid seared and sliced with Ahn’s special dressing</i> ($12.5):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-067.jpg?w=768' /><p>From the selection of seafood on the menu, this is what we ordered. I didn’t read the description, so I thought we would be given grilled squid legs instead of a whole squid. I like grilled squid legs better, but this was also good – albeit more chewy in texture. The squid tasted fresh, and went well with the sauce drizzled on top. I don’t remember what kind of sauce it was though, since I ate the squid mostly with the red hot sauce provided on the side. I thought that the squid tasted better with the hot sauce, as it tastes a little bland on it’s own.</p><p><b>Seafood Pancake </b>($16.5):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-071.jpg?w=768' /><p>This was super delicious, my favourite out of everything ordered that night. The pancake was filled with green onion, crab meat, squid, etc. The sauce went really well with the pancake – I think it was some sort of soy sauce based sauce with a few white sesame seeds mixed inside. The pancake was very flavourful, and not too doughy. The portion size was big and just enough to share among four people.</p><p><b>Spicy Rice Cake with Seafood </b>($17.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-075.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-079.jpg?w=768' /><p>This was ordered from the “New Menu”. I was so excited to see that they offered it here, because I didn’t see it when I browsed the menu online. Dukbokki (spicy rice cake in Korean) is one of my favourite Korean dishes, and Chungdam Ahn’s version did not disappoint. The portion was very large – hard to tell in the picture, but there was a lot of stuff in the bowl. It came with an abundance of seafood which included clams, pieces of squid, and shrimp. There were also pieces of cabbage, which I would presume to be the “fillers”. I love the rice cake that is used in this dish because it is shorter and fatter than the typical long, skinny ones used in most Korean restaurants. These kind are more chewy and bite-size.</p><p><b>Bulgolgi</b> – <i>marinated sirloin pan fried with salad on the side</i> ($13.9):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-081.jpg?w=768' /><p>This dish was just average, nothing really spectacular about it. The presentation of the dish was nice, however, and the salad on the side balanced out the meat well. The beef was flavourful and well-cooked, but I probably wouldn’t order this again if I were to come back.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/chungdam-ahn-chicco-110.jpg?w=768' /><p>I thought the service that night wasn’t so great. Our waitress wasn’t all that friendly, and didn’t come by frequently to check how we were doing, or to refill our empty water glasses.</p><p>Had it not been the online promotion, I probably would never have the chance to find out about this restaurant. Overall, I thought that the quality of food was good, though the price is a little high. Unlike Japanese izakayas, the portion sizes here are quite big and not tapas sized, so I suggest going with a group of friends. That way, you get to try more different things as well! I thought that the food we ordered were pretty good, and next time I’ll probably try their signature dishes.</p><a href='https://www.zomato.com/vancouver/chungdam-ahn-west-end'>Chungdam Ahn on Zomato</a>"
    },
    {
      "id": 9,
      "title": "Qoola Frozen Yogurt (Metrotown)",
      "content": "<p>I really love the concept of self-serve frozen yogurt stores. Basically, you load your cup up with frozen yogurt, add toppings to your heart’s desire, weigh it, pay, and eat up! I love putting toppings on my yogurt, and can never stick to just one. I want a taste of everything! Self-serve yogurt places are perfect for people like me who go crazy with the toppings. The only downside is that you don’t know what to expect when you fill your cup up with goodies, and it can get pretty expensive if you don’t control yourself.</p><p>Qoola is a Vancouver based frozen yogurt chain that is also located on Denman St in downtown and in Aberdeen Mall at Richmond. The Metrotown Qoola used to be the only self-serve store that was offered, but I heard that the Richmond location underwent renovation a few months back and is now converted to a self-serve store as well.  Since I had some coupons that I bought online a while back, my mom and PonDeRing  joined me one day to Qoola for some delicious frozen yogurt.</p><p>This is how their soft-serve yogurt machines look like:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-75.jpg?w=768&h=576' /><p>Qoola changes their yogurt flavours from time to time, and on this occasion they had <b>original, green tea, raspberry, chocolate, country vanilla,</b> and <b>strawberry</b>. They used to offer cheesecake flavour at the Richmond location, which is PonDeRing’s favourite. Too bad it was a limited flavour, and they took it off the menu. Wonder if they’ll ever bring it back?</p>  <p>Here is a snapshot of the wide array of toppings they have for you to choose from:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-76.jpg?w=768&h=576' /><p>They have dry toppings such as granola, cereal, almonds, and chocolate chips,and fruit toppings like strawberries, blueberries, and mango. They also have tiny mochi pieces here, which is one of my favourite foods of all time. They even offer sauces like chocolate or caramel for those who wish to add some more flavour to their yogurt. Neat!</p><p>Since we had a $5 for $10 coupon, we each got a cup:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-77.jpg?w=768&h=576' /><p><b>Original, Green tea, and Strawberry Frozen Yogurt:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-81.jpg?w=768&h=576' /><p>The frozen yogurt was smooth and tasted very refreshing. My favourite flavour was the strawberry frozen yogurt, which was light tasting and reminded me of strawberry milk. The green tea was also good, though I would have preferred the matcha flavour to be a little stronger. The original flavour was a little too sour for me, considering the fact that I do have a penchant for sweet things. I got used to the flavour after a while though, and it went well with the sweeter toppings. I still like the plain soft serve frozen yogurt that they have at Yogen Fruz, which tastes less sour and has a wonderful flavour.</p><p><b>Chocolate and Country Vanilla Frozen Yogurt:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-82.jpg?w=768&h=576' /><p>My mom enjoyed her yogurt, and filled her cup with lots of strawberries and almonds.</p><p><b>Chocolate, Raspberry, Country Vanilla, and Strawberry Frozen Yogurt:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/04/hot-pot-and-froyo-friday-001-83.jpg?w=768&h=576' /><p>PonDeRing really enjoyed the country vanilla, and thought it was the best flavour out of the ones she tried that day.</p><p>Besides frozen yogurt, Qoola also offers smoothies and waffles for those who want something different. For the frozen yogurt, they only offer you one size for the cup, which is quite large. I wish that they offered smaller cups though, since I find it to be a little awkward to eat a tiny portion of yogurt in a huge cup. It’s also harder to make the yogurt look nice if you have such a big cup, although in the end the taste is all that matters. On a side note, I love how Qoola is environmentally friendly, as all their cups, utensils, etc. are biodegradable or recyclable.</p><a href='https://www.zomato.com/vancouver/restaurants/qoola'>Qoola Frozen Yogurt + Fruit (Metrotown) on Zomato</a>"
    },
    {
      "id": 10,
      "title": "Po King Seafood Restaurant",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-074.jpg?w=768' /><p>So the other day, I was craving for some dim sum after not having it for quite some time. Since I don’t go to dim sum restaurants often, it’s always a fun experience for me when I do. I used to go eat it with my family occasionally, but I find it much more liberating to go with friends. Whenever I went with my family, the grown-ups ordered the food that they wanted to eat while the kids sat in silence and watched their favorite food being wheeled away from them by the women pushing the dim sum carts. However, when you’re with friends, you can order anything and everything you can manage to finish eating. On this occasion, I went with PonDeRing, Mochi, and JL. We left the decision of which restaurant to dine at to Mochi who chose Po King Seafood Restaurant.</p><p>If any of you remember Big Lai Palace (the dim sum joint near Metrotown that was closed down a long way back), you will recognize the lady boss who used to run that place at Po King.  Don’t expect friendly service here, because everyone looks too overworked and underpaid to care. But we were there for the food, and that was all that mattered.</p><p>All the dim sum items are priced at $2.95 (if I recall correctly), which is relatively cheap compared to other places. Po King still has the dim sum carts, which I prefer over ordering from a sheet because it’s more old school that way. I know the food will not be as fresh, but I  like seeing my food before ordering it. Although I usually end up ordering more this way as well.</p><p>We started off with a pot of tea. Can’t have dim sum without tea, can you?</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-003.jpg?w=768' /><p>We ordered quite a lot, so be prepared to feast your eyes!</p><p><b>Har Gow (shrimp dumplings):</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-007.jpg?w=768' /><p>The shrimps were huge, so they definitely were not being cheap with this dish. It was good, although the skin was a bit gummy, and not as thin as I would have liked.</p><p><b>Chicken Feet:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-013.jpg?w=768' /><p>People who are unfamiliar with this dish would be scared to try it, but I swear it’s not as bad as it looks! It’s actually very delicious.</p><p><b>Siu Mai:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-016.jpg?w=768' /><p>This was poorly made. I only took a bite of this and didn’t want to eat anymore. The siu mai was mostly filled with chunks of fat, and not enough meat to balance it out.</p><p><b>Rice wrapped in bamboo leaf:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-017.jpg?w=768' /><p>This dish was just so-so, not as good as they used to make it at Big Lai Palace. There were pieces of chicken inside, but very little. There was also too much rice, and the flavour from the bamboo leaf didn’t infuse into the rice enough.</p><p><b>Rice rolls wrapped with shrimp:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-020.jpg?w=768' /><p>This is one of my favourite dishes, and a must order whenever I go to eat dim sum! It doesn’t look too appealing in this picture, but I can assure you it is good. The shrimps were crunchy and not over-cooked, just the way it’s supposed to be. Nothing  to complain about here!</p><p><b>BBQ Pork Pastry:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-024.jpg?w=768' /><p>I know that this dish can’t be too good for you, but I love it anyway. The skin was flaky with just the right amount of filling.</p><p><b>Tapioca Pudding:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-025.jpg?w=768' /><p>This was more like a dessert dish. I have never tried this before, but I thought it wasn’t too bad. It was a custard like dish filled with clear tapioca balls. Not a dish I would order, but it was interesting to try something new.</p><p><b>Sesame Balls:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-028.jpg?w=768' /><p>This is my absolute dim sum favourite… from childhood until now. This version of the sesame ball is a little different than the kind usually filled with red bean paste. It is bigger and has no filling inside. PonDeRing likes this version more than the ones with the fillings, but I’m more of a traditionalist. The huge sesame balls are good, but I still like the traditional filled kind more. Be sure to eat this while it’s still hot, since the skin becomes hard (and oily) once it gets cold.</p><p><b>Chinese doughnut wrapped with rice roll:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-032.jpg?w=768' /><p>I enjoyed this dish, but would prefer more sauce to soak the Chinese doughnuts in. Yummy nevertheless.</p><p><b>BBQ Pork Bun:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-033.jpg?w=768' /><p>I did not try this, so can’t comment on it.</p><p><b>Egg Yolk Custard Bun:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-035.jpg?w=768' /><p>I regret ordering this. I wanted to give it a try since I’ve never had it before, but it was a bad idea. I thought that there was too little filling, and I did not enjoy eating the tasteless part of the bun. The custard part of the bun wasn’t very good either.</p><p><b>Ma Lai Gao (malay cake):</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/dim-sum-karaoke-038.jpg?w=768' /><p>This was a kind of steamed cake. Super good, couldn’t leave without ordering this! A not too sweet dessert to finish off the meal.</p><p>We couldn’t finish everything all the food, so we packed some to go. There was also this fried fish dish that I forgot to take a picture of. Although we ordered a lot of food, the total only came up to around $10 per person. The great thing about dim sum is that every single dish is shared, so you get to try a bit of each dish without being too full.</p><p>The service was basically non-existent throughout our meal. We had to get up to fill the tea with hot water from this table ourselves. Same goes with getting clean bowls.</p><p>Overall, this place was not as terrible as some people made it out to be. Tthe food was not exceptional, but good for what you pay for. If you can disregard the bad service and just go for the food, then I promise that you won’t be too disappointed.</p><a href='https://www.zomato.com/vancouver/vancouver-restaurants?q=po+king'>Po King Seafood Restaurant on Zomato</a>"
    },
    {
      "id": 11,
      "title": "Ap Gu Jung Korean Restaurant",
      "content": "<p>The plan for the day originally was to dine at Chungdam Ahn for lunch, and then head over to WE coffee for afternoon tea. I had some coupons bought online on my hands that I was keen to use up before they expired. Despite knowing beforehand that Chungdam Ahn is an izakaya style restaurant and izakayas generally open for business at night, I failed to register that thought until after arriving at the doorstep of the closed restaurant. What now? Well, we were in the heart of downtown Vancouver after all, and there were plenty of restaurants in the vicinity. It was a typical wet and rainy Vancouver day, and we were craving for Korean food with a vengeance. Walking along Robson Street, I think that it was Apgujung’s outdoor patio that caught our eye and compelled us to walk inside.</p><p>Although the restaurant was not packed (given that it was a bleary Sunday and past lunch time), there were still quite a few tables that were filled. Despite this, I spotted only one server who had to do everything from waiting tables to getting customers their bills after they were done eating. After browsing the menu and making up our minds, we had to wait quite a while before the waiter finally came to take our orders. I think that under the circumstances, the waiter did a fairly good job at multitasking and doing his job to the best of his ability. The restaurant was without a doubt understaffed that day, and the slow service did not exactly leave a good impression.</p><p>Like most Korean restaurants, we started off with an assortment of banchan (side dishes).</p><p><b>Kimchi, Potato, Seaweed,</b> and <b>Bean Sprouts:</b></p><p>My favourites out of the above side dishes were the kimchi and seaweed.I don’t know how good the kimchi was in Korean standards; but I love kimchi, so nothing to complain about here. The potato dish was also quite delicious, and we asked for refills for all three dishes.</p><p><b>Spicy Vegetable Soup with Beef & Noodles </b>($8.95):</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/feb-6-2011-downtown-trip-with-moomy-029.jpg?w=768' /><p>It came with a small bowl of rice on the side. The soup was super delicious and very flavourful – perfect to drink on a chilly day. It was filled with lots of bean sprouts, green onions, beef, and super yummy glass noodles. If I recall correctly, it was not too spicy (to me at least), so don’t be intimidated to give this dish a try. I was disappointed that I couldn’t taste the gochujang (hot pepper paste) in this dish. From the picture, it looks like chili oil was used instead.</p><p><b>Soft tofu hot pot with beef </b>($8.95)</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/03/feb-6-2011-downtown-trip-with-moomy-036.jpg?w=768' /><p>This came with mushrooms, tofu, and an egg. The egg yolk was taken out by PonDeRing and mixed with rice. So scrumptious! I actually preferred this soup dish over the other, as I liked the ingredients in this more and thought that the soup was more flavourful as well. The beef in this soup came in small pieces, unlike the other dish that came with big chunks of beef.</p><p>While Ap Gu Jung will not be my go-to place for Korean food, I thought that the food was pretty decent. This place is great for large gatherings, so I suggest coming with a few friends.</p><a href='https://www.zomato.com/vancouver/ap-gu-jung-korean-cuisine-west-end'>Ap Gu Jung Korean on Zomato</a>"
    },
    {
      "id": 12,
      "title": "La Bretagne Crêperie",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-015.jpg?w=768' /><p>Prior to this visit, I have never had an authentic French crêpe before. Cafe Crêpe doesn’t count, right? According to my friend Lady Grey, who has been to Montreal before, La Bretagane Crêperie is as authentic as it gets to French crêpes in Vancouver.</p><p>I didn’t get a chance to take a picture of the exterior of the restaurant, as it was snowing/raining and I didn’t want to damage my camera. However, this place is pretty easy to locate – it’s just right off the side of Robson St on Jervis.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-017.jpg?w=768' /><p>Inside, the restaurant is small and homey. Upon entering, we were seated immediately and given glasses of cold water. It was a cold day that day, so we requested for warm water,which our waitress graciously obliged.</p><p>We all decided to go for the savory crêpe, as it was lunch time when we got there, and no one was really in the mood for anything cold. Although the ice cream crêpe that this lady sitting across from us ordered looked enticing,I had to remind myself that there is always next time. For the savory crêpes, you have a choice between the <b>Crêpe Froment</b> (organic white flour) or the <b>Galette Sarazin</b> (organic buckwheat flour). The difference between the two is that crêpes are traditionally made with white wheat flour and filled with sweet ingredients, while galettes are made with buckwheat flour and have savory fillings.</p><p><b>Spinach and Salmon Crêpe with White Wine Sauce </b>$9.75:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-021.jpg?w=768' /><p>I got this on the buckwheat galette. The galette was presented  folded up into a square, unlike the cone shaped crepes that I am more familiar to seeing. Apparently, this is how crêpes are traditionally prepared in France. The crepe was freshly made, and was at just the right temperature to eat when it arrived in front of us. The crêpe skin was cooked perfectly, though the buckwheat took some time for me to get used to. The buckwheat gave the crêpe skin a grassy and earthy flavour, which I found really interesting. The taste of buckwheat is certainly not for everyone, so I suggest going with the white flour crêpe for those who want to play it safe. As I dug through the crêpe to reveal the salmon under the mound of spinach and sauce, I was pleasantly surprised that I was given a whole salmon fillet, and not just flakes of salmon or smoked salmon like I had expected when I ordered this. As for the sauce, I couldn’t really taste the wine. The flavour was there though – it was just very subtle. The creamy sauce went well with the spinach and salmon, but I thought there was a tad too much of it. I was a little disappointed with the spinach – I wish that it could have been more fresh, and less mushy.</p><p><b>Seafood and Mushrooms Crêpe with White Wine Sauce </b>$9.95:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-022.jpg?w=768' /><p>Although this was a “seafood’ crêpe, the only seafood that it contained was shrimp. The wine was very apparent in the shrimp that I tried.</p><p><b>Mushrooms, Black Forest Ham & Bechamel (Swiss Cheese extra 2.95) </b>$8.75:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-023.jpg?w=768' /><p>Didn’t try, but my friend enjoyed it!</p><p><b>Apple, Cinnamon, and Swiss Cheese (extra  $2.75 for sausages) </b>$6.95:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/ikas-20th-birthday-024.jpg?w=768' /><p>I had a bite of this, and it tasted amazing! I don’t know how well the sausages went with the apple and cinnamon flavours, however, especially after syrup was drizzled on top of the crêpe.</p><p>This cozy little restaurant is a great place for catching up with friends while bonding over delicious french crêpes. Service was prompt, and the waitress also made sure that everyone’s entrees arrived at the same time (so no one has to sit and watch others eat with their stomachs growling). Aside from their sweet crêpes and savory galettes, they also have soup, sandwiches, and baked crepes on the menu. While the prices for the crêpes here are more expensive compared to places such as Cafe Crêpe, they do give you plenty of filling.</p><p>I’ll definitely be back for more the next time a craving hits!</p><a href='https://www.zomato.com/vancouver/la-bretagne-creperie-west-end'>La Bretagne Creperie on Zomato</a>"
    },
    {
      "id": 13,
      "title": "Guu Garden",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-001.jpg?w=768' /><p>Ever since Guu Garden opened on Nelson St last year, I’ve been meaning to give it a try. On this visit, Monkey, Apple, and I were here to celebrate Lady Grey’s birthday. Having been to the Thurlow and Robson locations and left satisfied on both occasions, I was curious about what how Guu Garden would measure up. Although there are five different Guu locations in Greater Vancouver, they each have their own specializations that makes them stand out from one another. For this reason, I was eager to give Guu Garden a try and to sample some of their oden, which happens to be what this location specializes in.</p><p>For those who don’t know, <a href='https://en.wikipedia.org/wiki/Oden'>oden</a> is a hot pot popular in the winter that consists of ingredients such as fish cakes, daikon radish, boiled eggs, and tofu.</p><p>Having never been to Japan before, my oden standards are not high at all. The only kind that I’ve tried before is from the 7-eleven convenience stores in Taiwan, which is by no means authentic (but so good nonetheless). For this reason, I am only able to judge on the taste and quality of the oden alone. Unless someone knowledgeable  can convince me otherwise, I will put my faith in Guu Garden and trust that they are serving me authentic oden reminiscent of the kind made in Japan.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-004.jpg?w=768' /><p>Although we did not make a reservation on a Saturday night, we were seated promptly without much of a wait. Unlike the Thurlow location, the ambiance at Guu Garden is not as loud, something that izakayas are synonymous with. Our waitress was friendly and gave us some time to peruse through the extensive and exciting menu upon taking our orders.</p><p><b>Sakura Fizz in Love:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-014.jpg?w=768' /><p>I really enjoyed this drink. I don’t remember what the contents were anymore, but it tasted light and refreshing , with just the right balance of sweetness.</p><p><b>The Strawberry Season:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-012.jpg?w=768' /><p><b>Snow White:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-011.jpg?w=500&h=667&zoom=2' /><p><b>Kabocha Korroke:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-016.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-023.jpg?w=768' /><p>This is a pumpkin croquette with a boiled egg in the centre and drizzled with their original mayonnaise sauce. The first time I tried this dish, I instantly fell in love with it. The sweetness of the pumpkin pairs so well with the egg and mayo sauce on top. This is a must-eat for me whenever I go to Guu.</p><p>Since their specialty is oden, we all got the assorted oden special which came with five pieces of oden of your choice. You also have a choice between the kanto or miso soup base. I went with the <b>kanto-daki</b> with <b>a free range egg, taro jelly (konnyaku), daikon radish, chikuwa fish cake,</b> and <b>mochi tofu bag:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-027.jpg?w=768' /><p>According to the menu, the kanto-daki is a light soy sauce based soup while the miso-oden is miso based and slightly richer. When they came with the bowl of oden, I thought that they had missed an item, as the mochi tofu bag was missing. It turns out that it takes longer to prepare, so you have to wait awhile.</p><p>This also came with a small smear of wasabi on the side of the bowl for flavouring. The kanto soup base was very light and flavourful, and the oden items soaked up the flavour of the broth well. I especially enjoyed the konnyaku, which has always been a favorite of mine because of its jelly-like texture. The chikuwa fish cake was chewy and cooked to perfection. The daikon was probably the most flavorful out of the ones listed above, as it soaked in the most of the kanto-daki.</p><p><b>Mochi Tofu Bag:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-029.jpg?w=768' /><p>This was definitely my favorite oden item. I’ve never tried anything like this before, so I was pleasantly surprised when I bit into the soft skin of the tofu to find a piece of sticky mochi hidden within the parcel!  Definitely order this, you will not be disappointed. Even the “ribbon” is edible!</p><p><b>Miso-oden:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-028.jpg?w=768' /><p>I didn’t get a chance to try this, but the colour of the soup looks significantly darker than the kanto-daki.</p><p><b>Avocado and Four Cheese Pizza:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-024.jpg?w=768' /><p>This dish was ordered off the specials menu. The avocado and the cheese on the pizza made this dish very creamy and delectable. The pizza “dough” is just a flour tortilla, however, so it was very thin. I didn’t find this dish very creative nor interesting — it was just okay.</p><p>And how could we end our meal without dessert? </p><p><b>Chestnut Cheesecake:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-031.jpg?w=768' /><p><b>Kabocha Pudding :</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/sayus-20th-birthday-033.jpg?w=768' /><p>Both desserts were delicious and a good way to end off the meal.</p><p>Although there were still many dishes that I wanted to try,  they will just have to be put on hold until my next visit. While I enjoyed the oden at Guu Garden, I still prefer the other Guu locations more for the noisy and lively ambiance.</p><p>Nevertheless, nothing speaks comfort more than a warm bowl of oden on a cold, rainy day.</p><a href='https://www.zomato.com/vancouver/guu-garden-downtown-vancouver'>Guu Garden on Zomato</a>"
    },
    {
      "id": 14,
      "title": "Top of Vancouver Revolving Restaurant",
      "content": "<img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-065.jpg?w=768' /><p>The Top of Vancouver Revolving Restaurant is the kind of restaurant where you know of its existence, but never bother to venture inside. For one, the food is probably pricey given its location 553 feet (167m) above the ground. Also, there are so many great restaurants located on the ground level nearby that one is hardly tempted to make the effort to go up there. Nevertheless, when an opportunity arose for me to finally pay the infamous revolving restaurant atop Harbour Centre a visit, I was excited.</p><p>To get up there, you have to take an elevator that transports you directly to the top floor. The elevator has glass sides so you get to look outside and see to streets and buildings down below shrink in size as you go up. I suggest going there for dinner, as the panoramic view of Vancouver at night from the wide windows all around the restaurant is simply breathtaking.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-096.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-102.jpg?w=768' /><p>What I like about this restaurant is that it doesn’t matter where the server seats you; one revolution is made every 60 minutes, so one has the opportunity to enjoy the scenery outside from different locations. During the course of our meal, we completed around three revolutions, which approximates to three hours spent dining at the restaurant.</p><p>Our waitress started us off with some bread:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-075.jpg?w=768' /><p>It came warm with some whipped butter on the side.</p><p><b>White Bean Soup with Double Bacon</b> $10:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec2b102b20102b-2bharbour2bcentre2bdinner25212b0742.jpg?w=768' /><p>Mochi, PonDeRing, and I shared the soup of the day.I remembered the consistency of the soup to be very thick… probably due to the beans. There was also traces of bacon bits in the soup, which was a nice touch. Overall, this dish was good, but not memorable.</p><p><b>Lobster Bisque <i>(lobster meat, croutons, and cognac crème fraîche)</i> $12:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-108.jpg?w=768' /><p>Since one bowl of soup was devoured in no time shared between three people, we also got another one to share. This dish was very good. The soup was creamy, without being overly so. In my opinion, it was the best dish of the night.</p><p><b>Smoked Salmon and Crab Croquette </b><i>(stuffed with Brie cheese and topped with chipotle roasted pepper aioli)</i> $15:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-106.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec2b102b20102b-2bharbour2bcentre2bdinner25212b107.jpg?w=768' /><p>We also ordered an appetizer to share. We wanted to try something a little more different, so we went ahead and ordered this. We were lured by the promise of brie cheese. Cheese in anything is good, right? Unfortunately, I was a little disappointed when this dish arrived. For $15, I was expecting something more unique and fine dining-esque. Sad to say, the crab cake was exactly what it was – a crab cake. The brie in the croquette was indeed creamy and cheesy, but it didn’t stand out. The smoked salmon was lacking from what I can remember. Then again, as this croquette was shared among four people, maybe I’m not giving it the recognition that it deserves.</p><p><b>Blackened Halibut Filet </b><i>(served with papaya and mango salsa in green peppercorn white wine sauce)</i> $36:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-119.jpg?w=768' /><p>I apologize for the bad photos…it was extremely dim in the restaurant, and I don’t like how pictures with flash turn out. Anyhow, the fish was tender and well done, yet there was nothing exceptional about it in terms of taste. The papaya and mango salsa was n0thing to shout about either.</p><p><b>New York Steak</b> <i>(10 oz. grilled New York AAA steak served with peppercorn red wine sauce) </i>$42:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-121.jpg?w=768' /><p>The steak was done medium rare as requested. The meat was juicy and tender, and its flavour was further enhanced by the red wine sauce. Needless to say, PonDeRing really enjoyed it! This dish is on the pricey side, however, considering you can get good quality steak for less at other fine dining restaurants.</p><p><b>Alaska King Crab Legs </b>and the <b>Steamed Stuffed B.C. Wild Salmon Filet:</b></p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-117.jpg?w=768' /><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-1181.jpg?w=768&h=576' /><p><b>Top of Vancouver Mango Cheesecake </b><i>(Unbaked cream cheese, marscapone, and a touch of brandy. Served with strawberry coulis and crème anglaise)</i> $10 :</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-128.jpg?w=768' /><p>After our mains, we ended our meal with something sweet. The presentation of this dessert was done well. The taste of mango in the cheesecake was weak, but there. I prefer baked cheesecakes to their unbaked counterparts, so I can’t really comment on this dessert. I recall that this dish was more like a mousse than a traditional cheesecake – just a heads up for those who was expecting otherwise (like me).</p><p><b>Chocolate Frangelico Tower <i>(light chocolate sponge cake with Frangelico cream. Served in a milk, white, and dark chocolate tower)</i> </b>$10.50:</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-125.jpg?w=768' /><p>I can’t comment on how this dessert was as I didn’t get to try it. As the saying goes, you can’t judge a book by its cover. However, in terms of appearance alone, I give this a 5/5.</p><p><b>Strawberry Napoleon </b><i>(round puff pastry stuffed with cream cheese and strawberries marinated in honey, orange brandy, lemon zests)</i>$10.</p><img alt='' src='https://tastyaffairs.files.wordpress.com/2011/02/dec-10-2010-harbour-centre-dinner-1261.jpg?w=768&h=576' /><p>Overall, I didn’t enjoy the food as much as I would have liked, but that’s to be expected in a restaurant more known for its location. In total, the bill came to around $600 for just seven people. Definitely on the pricey side, but we did also order two bottles of red wine. Although the hype of restaurants in the sky have came and gone, I’ll say the view and ambiance is well worth paying this place a visit. Just don’t go expecting great food.</p><a href='https://www.zomato.com/vancouver/top-of-vancouver-revolving-restaurant-downtown'>Top of Vancouver Revolving Restaurant on Zomato</a>"
    }
  ]
}